ayourk/dsPIC_SPI_SD/skSD.c
/*******************************************************************************
*  skSDlib.c - ＭＭＣ／ＳＤカードアクセス関数ライブラリ                        *
*                                                                              *
*    SD_Init     - ＭＭＣ／ＳＤＣの初期化を行う処理                            *
*    SD_Open     - ファイルのオープンを行う処理                                *
*    SD_Close    - ファイルのクローズを行う処理                                *
*    SD_Write    - ファイルへ指定したバイト数だけ書き込む処理                  *
*    SD_Read     - ファイルから指定したバイト数だけ読み込む処理                *
*    SD_fGets    - ファイルから１行読み込む処理                                *
*    SD_Size     - ファイルのサイズを得る処理                                  *
*    SD_Position - ファイルの読書きポインタ値を得る処理                        *
*    SD_Seek     - ファイルの読書きポインタを移動させる処理                    *
*                                                                              *
*    メモ：SS ：13番ピン(RC2) SCK：14番ピン(RC3)  SDI：15番ピン(RC4)           *
*          SDO：16番ピン(RC5)を使用                                            *
*          標準SD・MicroSD(FAT16)/標準SDHC・MicroSDHC(FAT32)のみ読書きＯＫ     *
* ============================================================================ *
*  VERSION DATE        BY                    CHANGE/COMMENT                    *
* ---------------------------------------------------------------------------- *
*  1.00    2012-04-30  きむ茶工房(きむしげ)  Create                            *
*  2.00    2012-05-03  きむ茶工房(きむしげ)  SDHCに対応                        *
*  2.01    2012-06-09  きむ茶工房(きむしげ)  標準SD/SDHCもOKコメントを変更     *
*  2.02    2014-02-02  きむ茶工房(きむしげ)  XC8 C Compiler 対応に変更         *
*  3.00    2014-09-01  ロッシさんからの報告  不具合修正                        *
*  3.01    2014-09-03  きむ茶工房(きむしげ)  ファイル名8文字不可不具合を修正   *
*  3.02    2014-09-03  きむ茶工房(きむしげ)  Seek()のフラグ4の処理を変更       *
* ============================================================================ *
*  PIC 16F1938 18F25K22                                                        *
*  (たぶんその他のPICでもSRAMが768byte以上有ればこの関数はそのまま利用可能と思う)*
*  MPLAB IDE(V8.63)                                                            *
*  MPLAB(R) XC8 C Compiler Version 1.00                                        *
*******************************************************************************/
#include <xc.h>
#include <string.h>
#include <libpic30.h>
//#include "skMonitorLCD.h"
//#include "skSPI.h"
//#include "skSD.h"


// 定数の定義
#ifndef LOW
#define LOW  0
#endif
#ifndef HIGH
#define HIGH 1
#endif

#define SPI_MODE0 0           // クロック極性(0:LOW)  クロック位相(0:アイドル0Vで、0V->5Vに変化で転送)
#define SPI_MODE1 1           // クロック極性(0:LOW)  クロック位相(1:アイドル0Vで、5V->0Vに変化で転送)
#define SPI_MODE2 2           // クロック極性(1:HIGH) クロック位相(0:アイドル5Vで、5V->0Vに変化で転送)
#define SPI_MODE3 3           // クロック極性(1:HIGH) クロック位相(1:アイドル5Vで、0V->5Vに変化で転送)
#define SPI_CLOCK_DIV4   0x0  // 通信速度  Fosc/4
#define SPI_CLOCK_DIV16  0x1  // 通信速度  Fosc/16
#define SPI_CLOCK_DIV64  0x2  // 通信速度  Fosc/64
#define SPI_CLOCK_DIVT2  0x3  // 通信速度  TMR2の出力の1/2
#define SPI_CLOCK_DIVADD 0xA  // 通信速度  FOSC/((SSPxADD + 1)*4)

//#define SPI_MSSP2_USE         // MSSP2を利用する場合はコメントを外します。
// ＭＳＳＰモジュールのレジスター定義
/*
#if defined(_16F1933)||defined(_16F1934)||defined(_16F1936)||\
    defined(_16F1937)||defined(_16F1938)||defined(_16F1939)
// 16F193x用のMSSPを利用する場合の定義
#define SPI_SSPCON1         SSPCON1
#define SPI_SSPSTAT         SSPSTAT
#define SPI_SSPADD          SSPADD
#define SPI_SSPBUF          SSPBUF
#define SPI_SSPIF           SSPIF
#else
#ifdef  SPI_MSSP2_USE
// MSSP2を利用する場合の定義
#define SPI_SSPCON1         SSP2CON1
#define SPI_SSPSTAT         SSP2STAT
#define SPI_SSPADD          SSP2ADD
#define SPI_SSPBUF          SSP2BUF
#define SPI_SSPIF           SSP2IF
#else
// MSSP1を利用する場合の定義
#define SPI_SSPCON1         SSP1CON1
#define SPI_SSPSTAT         SSP1STAT
#define SPI_SSPADD          SSP1ADD
#define SPI_SSPBUF          SSP1BUF
#define SPI_SSPIF           SSP1IF
#endif
#endif
*/

// 関数のプロトタイプ宣言
void SPI_Init(void) ;
//void SPI_setDataMode(char mode) ;
//void SPI_setClockDivider(char divider,char rate) ;
char SPI_transfer(char dt) ;


#ifndef _XTAL_FREQ
 // Unless already defined assume 8MHz system frequency
 // This definition is required to calibrate __delay_us() and __delay_ms()
 #define _XTAL_FREQ 8000000    // 使用するPIC等により動作周波数値を設定する
#endif

////////////////////////////////////////////////////////////////////////////////
// ＳＰＩ関連

#define CS   PORTBbits.RB2                        // カード選択信号

////////////////////////////////////////////////////////////////////////////////
// ＭＭＣ／ＳＤＣアクセス関連

#define CMD0   0x00                     // カードへのリセットコマンド
#define CMD1   0x01                     // MMCへの初期化コマンド
#define CMD8   0x08                     // 動作電圧の確認とSDCのバージョンチェック
#define CMD12  0x0C                     // データ読込みを停止させるコマンド
#define CMD13  0x0D                     // 書込みの状態を問い合わせるコマンド
#define CMD16  0x10                     // ブロックサイズの初期値設定コマンド
#define CMD17  0x11                     // シングルブロック読込み要求コマンド
#define CMD24  0x18                     // シングルブロック書込み要求コマンド
#define ACMD41 0x29                     // SDCへの初期化コマンド
#define CMD55  0x37                     // ACMD41/ACMD23とセットで使用するコマンド
#define CMD58  0x3A                     // OCRの読出しコマンド

#define SECTER_BYTES  512               // １セクタのバイト数

extern char MMCbuffer[SECTER_BYTES] ;          // ＭＭＣカード読書きバッファ
extern int  CardType ;                         // カードの種類
extern int  FatType ;                          // ＦＡＴの種類


////////////////////////////////////////////////////////////////////////////////
// ＦＡＴ関連

#define O_READ    0x01                  // ファイルの読込みオープン
#define O_RDWR    0x02                  // ファイルの読込みと書込みオープン
#define O_APPEND  0x04                  // ファイルの追加書込みオープン

//ＦＡＴファイルシステムのパラメータ
extern unsigned long Dir_Entry_StartP ;        // ディレクトリエントリの開始セクタ位置
extern unsigned int  DirEntry_SectorSU ;       // ディレクトリエントリのセクタ個数
extern unsigned long Data_Area_StartP ;        // データ領域の開始セクタ位置
extern unsigned long Fat_Area_StartP ;         // FAT領域の開始セクタ位置
extern unsigned int  Cluster1_SectorSU ;       // １クラスタあたりのセクタ数
extern unsigned long SectorsPerFatSU ;         // １組のFAT領域が占めるセクタ数

// ファイルのアクセス情報
struct FDS {
     unsigned int  Oflag ;              // アクセスするオープンフラグを保存
     unsigned int  DirEntryIndex ;      // ディレクトリエントリの検索した場所の位置
     unsigned long FileSize ;           // ファイルのサイズ
     unsigned long FileSeekP ;          // ファイルの次読み出す位置
     unsigned long AppendSize ;         // 追加書込みしたファイルのサイズ
     unsigned long FirstFatno ;         // データ格納先のFAT番号
} ;
