ayourk/dsPIC_SPI_SD/skSD.c
extern struct FDS fds ;

// ＦＡＴファイルシステム(FAT12/FAT16)のパラメータ構造体(512バイト)
struct FAT_PARA {
     unsigned char jump[3] ;            // ブート用のジャンプコード
     unsigned char oemId[8] ;           // フォーマット時のボリューム名
     unsigned int  BytesPerSector ;     // １セクタあたりのバイト数、通常は512バイト
     unsigned char SectorsPerCluster ;  // １クラスタあたりのセクタ数
     unsigned int  ReservedSectorCount ;// ブートセクタ以降の予約領域のセクタ数
     unsigned char FatCount ;           // FATの組数(バックアップFAT数)、通常は２組
     unsigned int  RootDirEntryCount ;  // ディレクトリの作成可能個数、通常は512個
     unsigned int  TotalSectors16 ;     // 全領域のセクター総数(FAT12/FAT16用)
     unsigned char MediaType ;          // FAT領域の先頭の値、通常は0xF8
     unsigned int  SectorsPerFat16 ;    // １組のFAT領域が占めるセクタ数(FAT12/FAT16用)
     unsigned int  SectorsPerTrack ;    // １トラックあたりのセクタ数
     unsigned int  HeadCount ;          // ヘッド数
     unsigned long HidddenSectors ;     // 隠蔽されたセクタ数
     unsigned long TotalSectors32 ;     // 全領域のセクター総数(FAT32用)
     unsigned long SectorsPerFat32 ;    // １組のFAT領域が占めるセクタ数(FAT32用)
     unsigned int  FlagsFat32 ;         // FATの有効無効等の情報フラグ
     unsigned int  VersionFat32 ;
     unsigned long RootDirClusterFat32 ;// ディレクトリのスタートクラスタ(FAT32用)
     unsigned char Dumy[6] ;
     unsigned char FileSystemType[8] ;  // FATの種類("FAT12/16")(FAT32は20バイト下に有る)
     unsigned char BootCode[448] ;      // ブートコード領域
     unsigned char BootSectorSig0 ;     // 0x55
     unsigned char BootSectorSig1 ;     // 0xaa
} ;

// ディレクトリエントリーの構造体(32バイト)
struct DIR_ENTRY {
     unsigned char FileName[11] ;       // ファイル名(8)+拡張子(3)
     unsigned char Attributes ;         // ファイルの属性
     unsigned char ReservedNT ;         // Windows NT 用 予約領域
     unsigned char CreationTimeTenths ; // ファイル作成時間の1/10秒単位をあらわす
     unsigned int  CreationTime ;       // ファイルの作成時間(hhhhhmmmmmmsssss)
     unsigned int  CreationDate ;       // ファイルの作成日(yyyyyyymmmmddddd)
     unsigned int  LastAccessDate ;     // 最終のアクセス日
     unsigned int  FirstClusterHigh ;   // データ格納先のFAT番号上位２バイト
     unsigned int  LastWriteTime ;      // 最終のファイル書込み時間
     unsigned int  LastWriteDate ;      // 最終のファイル書込み日
     unsigned int  FirstClusterLow ;    // データ格納先のFAT番号下位２バイト
     unsigned long FileSize ;           // ファイルのサイズ
} ;

////////////////////////////////////////////////////////////////////////////////
//
int SD_Init() ;
int SD_Open(const char *filename,int oflag) ;
void SD_Close() ;
int SD_Write(char *buf,int nbyte) ;
int SD_Read(char *buf,int nbyte) ;
int SD_fGets(char *buf,int nbyte) ;
unsigned long SD_Size() ;
unsigned long SD_Position() ;
unsigned long SD_Seek(unsigned long offset,int sflag) ;



////////////////////////////////////////////////////////////////////////////////
// ＭＭＣ／ＳＤＣのカードを選択、CS信号のHIGH/LOWを出力する処理
void cs_select(int flag){
    
     CS = flag ;
     SPI_transfer(0xff) ;     // 確実にＣＳを切替える為にクロックを送信しておく
}
////////////////////////////////////////////////////////////////////////////////
// レディ状態のチェックを行う処理
int ready_check()
{
     int c ;
     
     c = 0 ;
     while (SPI_transfer(0xff) != 0xff && c<=500) {
          c++ ;
          __delay32(100) ;
     }
     if (c>=500) return 1 ;    // タイムアウト
     else        return 0 ;    // ＯＫです
}
////////////////////////////////////////////////////////////////////////////////
// ＭＭＣ／ＳＤＣへコマンドを送る処理
int send_command(unsigned char cmd, unsigned long arg)
{
     int x , ans ;

     cs_select(LOW) ;
     ans = ready_check() ;
     if (ans != 0) return 0xff00 ;           // カードは Busy らしい
     // コマンドの送信を行う
     SPI_transfer(cmd | 0x40) ;                             // コマンドの送信
     for (x=24 ; x >= 0 ; x -= 8) SPI_transfer(arg >> x) ;  // パラメータの送信
     x = 0XFF ;
     if (cmd == CMD0) x = 0X95 ;
     if (cmd == CMD8) x = 0X87 ;
     SPI_transfer(x) ;                                      // CRCの送信
     // コマンドの返答を待つ処理を行う
     x = 0 ;
     do {
          ans = SPI_transfer(0xff) ;
          x++;
     } while(ans & 0x80 && x < 256) ;
    if (x >= 256) ans = (cmd|0x40) << 8 ;    // レスポンスタイムアウト

    return ans ;
}
////////////////////////////////////////////////////////////////////////////////
// 指定のセクタ位置からデータを１ブロック(シングル・ライト)書込む処理
int sblock_write(unsigned long sector,char *buff)
{
     int i , ans ;

     if (CardType != 0x13) sector <<= 9 ;         // SDHCでない
     ans = send_command(CMD24, sector) ;          // シングル・リードコマンドの発行
     if (ans == 0) {
          SPI_transfer(0xfe) ;                    // データトークンの送信
          for (i=0 ; i<SECTER_BYTES ; i++) {
               SPI_transfer(*buff) ;              // データ部の送信
               buff++ ;
          }
          SPI_transfer(0xff) ;                    // CRCの部分を送信
          SPI_transfer(0xff) ;
          ans = SPI_transfer(0xff) ;              // レスポンスの受信
          ans = ans & 0x1F ;
		if (ans == 0x05) {
               ans = ready_check() ;
               if (ans != 0) ans = 0x8800 ;       // カードは Busy らしい
               else {
                    // 書込みが正常に行われたか問い合わせを行う
                    ans = send_command(CMD13, sector) ;
                    i  = SPI_transfer(0xff) ;
                    if (ans == 0) {
                         if (i != 0) ans = 0x8900|ans ; // 書込み失敗している
                    }
               }
          } else ans = 0x8800 | ans ;             // 書き込みエラー
     } else ans = CMD24 << 8 | ans ;              // CMD24エラー
     cs_select(HIGH) ;

     return ans ;
}
////////////////////////////////////////////////////////////////////////////////
// 指定のセクタ位置からデータを１ブロック(シングル・リード)読込む処理
int sblock_read(unsigned long sector,char *buff)
{
     int i , ans ;

     if (CardType != 0x13) sector <<= 9 ;         // SDHCでない
     ans = send_command(CMD17, sector) ;          // シングル・リードコマンドの発行
     if (ans == 0) {
          i = 0 ;
          // 返信データの１バイト目を待つ
          while(1) {
               ans = SPI_transfer(0xff) ;
               i++ ;
               if (ans != 0xff || i>=1000) {
                    if (i>=1000) ans = 0x8600 ;   // データトークンタイムアウト
                    break ;
               }
               __delay32(100) ;
          }
          // ２バイト目以降の受信
          if (ans == 0xfe) {
               for (i=0 ; i<SECTER_BYTES ; i++) {
                    *buff = SPI_transfer(0xff) ;
                     buff++ ;
               }
               SPI_transfer(0xff) ;               // CRCの部分を受信
               SPI_transfer(0xff) ;
               ans = 0 ;
          } else ans = 0x8600 | ans ;             // 読み込みエラー
     } else ans = CMD17 << 8 | ans ;              // CMD17エラー
     cs_select(HIGH) ;

     return ans ;
}
////////////////////////////////////////////////////////////////////////////////
// ＦＡＴファイルシステムのパラメータを読込む処理
int fat_para_read()
{
     union {
          unsigned char c[4] ;
          unsigned long l ;
     } dt ;
     struct FAT_PARA *fat ;
     int i , ans ;

     // カードの先頭から５１２バイト読み出す
     ans = sblock_read(0,MMCbuffer) ;
     if (ans == 0) {
          // BPB(ブートセクタ)までのオフセット値を取出す
          for (i=0 ; i<4 ; i++) {
               dt.c[i] = MMCbuffer[i+0x1c6] ;
          }
          // ＦＡＴファイルシステムのパラメータを読込む
          ans = sblock_read(dt.l,MMCbuffer) ;
          if (ans == 0) {
               fat = (struct FAT_PARA *)MMCbuffer ;
               // １クラスタあたりのセクタ数
               Cluster1_SectorSU = fat->SectorsPerCluster ;
               // １組のFAT領域が占めるセクタ数
               if (fat->SectorsPerFat16 != 0) {
                    FatType = 2 ;
                    SectorsPerFatSU = fat->SectorsPerFat16 ;
               } else {
                    FatType = 4 ;
                    SectorsPerFatSU = fat->SectorsPerFat32 ;
               }
               // ＦＡＴ領域の開始セクタ位置
               Fat_Area_StartP = fat->ReservedSectorCount + dt.l ;
               // ルートディレクトリエントリの開始セクタ位置
               Dir_Entry_StartP = Fat_Area_StartP + (SectorsPerFatSU * fat->FatCount) ;
               // データ領域の開始セクタ位置
               DirEntry_SectorSU = fat->RootDirEntryCount / (SECTER_BYTES / sizeof(struct DIR_ENTRY)) ;
               Data_Area_StartP  = Dir_Entry_StartP + DirEntry_SectorSU ;
               if (FatType == 4) DirEntry_SectorSU = Cluster1_SectorSU ;   // FAT32
          }
     }
     return ans ;
}
/*******************************************************************************
*  ans = SD_Init()                                                             *
*    ＭＭＣ／ＳＤＣの初期化を行う処理                                          *
*    標準タイプSD/SDHCとMicroSD/SDHCのFAT16/FAT32のみ利用可能                  *
*                                                                              *
*    ans  : 正常＝０  異常＝０以外のエラーコード値                             *
*******************************************************************************/
int SD_Init()
{
     unsigned long arg ;
     unsigned char r7[4] ;
     unsigned int i , ans ;

     CS       = 1 ;
     CardType = 0 ;

     // CLKを74クロック以上送信し、カードをコマンド待ち状態にする
     for (i = 0 ; i < 10 ; i++) SPI_transfer(0xFF) ;

     // カードにリセットコマンド(CMD0)を送信する(SPIモードに移行)
     ans = send_command(CMD0, 0) ;
     if (ans == 1) {
//          MonitorPuts("CMD0") ;
          // ＳＤＣ用の初期化処理を行う
          arg = 0 ;
          // 動作電圧の確認とカードのバージョンチェック
          ans = send_command(CMD8, 0x1AA) ;
          if (ans == 1) {
               for (i=0 ; i<4 ; i++) r7[i] = SPI_transfer(0xff) ;
               if (r7[3] == 0xAA) {
                    CardType = 0x12 ;                  // SDCver.2のカード
                    arg = 0X40000000 ;
               } else ans = 0x8200 ;                   // CMD8のエラー
          } else {
               if (ans & 0x4) CardType = 0x11 ;        // SDCver.1のカード
          }
          if (CardType != 0) {
//               MonitorPuts(":8") ;
               // ＳＤＣ用の初期化コマンド(ACMD41)を発行する
               i = 0 ;
               while(1) {
                    ans = send_command(CMD55, 0) ;
                    ans = send_command(ACMD41, arg) ;
                    i++ ;
                    if (ans == 0 || i>=2000) {
                         if (i>=2000) ans = 0x8300|ans ;    // ACMD41タイムアウト
                         break ;
                    }
                    __delay32(100) ;
               }
//               if (ans == 0) MonitorPuts(":A41") ;
               if (ans == 0 && CardType == 0x12) {
                    // Ver.2ならOCRの読出しコマンド(CMD58)を発行する
                    ans = send_command(CMD58, 0) ;
                    if (ans == 0) {
//                         MonitorPuts(":58") ;
                         for (i=0 ; i<4 ; i++) r7[i] = SPI_transfer(0xff) ;
                         if (r7[0] & 0x40) CardType = 0x13 ;// SDHCのカード
                    } else ans = CMD58 << 8 | ans ;         // CMD58エラー
               }
          } else {
               // ＭＭＣ用の初期化コマンド(CMD1)を発行する
               i = 0 ;
               while(1) {
                    ans = send_command(CMD1, 0) ;
                    i++ ;
                    if (ans != 1 || i>=2000) {
                         if (i>=2000) ans = 0x8100 ;   // 初期化タイムアウト
                         break ;
                    }
                    __delay32(100) ;
               }
               if (ans == 0) {
                    CardType = 0x01 ;                  // MMCのカード
//                    MonitorPuts(":1") ;
               } else {
                    if (ans != 0x8100) ans = CMD1 << 8 | ans ;   // CMD1エラー
               }
          }
          if (ans == 0) {
               // ブロックサイズの初期値を５１２バイトに再設定する
               ans = send_command(CMD16, SECTER_BYTES) ;
               if (ans != 0) ans = CMD16 << 8 | ans ;  // CMD16のエラー
//               else MonitorPuts(":16") ;
          }
     } else ans = CMD0 << 8 | ans ;                    // CMD0エラー
     cs_select(HIGH) ;

