ayourk/dsPIC_SPI_SD/skSD.c
     // 初期化が正常に終了したらＦＡＴファイルシステムのパラメータを読込む
     if (ans == 0) {
          ans = fat_para_read() ;
     }

//          MonitorPuts("CardType = ") ;
//          MonitorPuth(CardType,HEX) ;

     // ファイルのアクセス情報を初期化する
     fds.Oflag = 0 ;

     return ans ;
}
////////////////////////////////////////////////////////////////////////////////
// 指定ファイルのエントリ情報を得る、なければエントリの空の場所を得る処理
int search_file(char *filename,struct FDS *fds)
{
     struct DIR_ENTRY *inf ;
     int i , j , c , x , ans ;

     ans = c = 0 ;
     fds->DirEntryIndex = 0 ;
     // ディレクトリエントリの全セクタ分だけ繰り返す
     for (i=0 ; i<DirEntry_SectorSU ; i++) {
          // ディレクトリエントリのデータを読込む
          ans = sblock_read(Dir_Entry_StartP+i,MMCbuffer) ;
          if (ans == 0) {
               // １セクタ内のエントリの個数分だけ繰り返す
               x = SECTER_BYTES / sizeof(struct DIR_ENTRY) ;
               for (j=0 ; j<x ; j++ ) {
                    c++ ;
                    // ファイルのエントリを調べる
                    inf = (struct DIR_ENTRY *)&MMCbuffer[j*sizeof(struct DIR_ENTRY)] ;
                    if (inf->FileName[0] == 0x2e) continue ;// サブディレクトリ
                    if (inf->FileName[0] == 0xe5) {
                         if (fds->DirEntryIndex == 0) fds->DirEntryIndex = c ;
                         continue ;                         // 削除されたエントリ
                    }
                    if (inf->FileName[0] == 0x00) {
                         if (fds->DirEntryIndex == 0) fds->DirEntryIndex = c ;
                         i = DirEntry_SectorSU ;
                         ans = 2 ;                          // 検索されなかった
                         break ;                            // 空のエントリ
                    }
                    // ファイルの属性を調べる
                    if (inf->Attributes != 0x20) continue ; // 普通のファイルでない
                    // ファイル名を比較する
                    if (memcmp(inf->FileName,filename,11) == 0) {
                         fds->DirEntryIndex = c ;
                         // ファイルのアクセス情報を設定する
                         fds->FileSeekP = 0 ;               // ファイルの読込む位置は０
                         fds->FileSize = inf->FileSize ;    // ファイルのサイズ
                         // データ格納先のFAT番号を記録
                         fds->FirstFatno = inf->FirstClusterHigh ;
                         fds->FirstFatno = (fds->FirstFatno<<16) | inf->FirstClusterLow ;
                         i = DirEntry_SectorSU ;
                         ans = 1 ;
                         break ;                            // 正常終了
                    }
               }
          } else ans = -1 ;
     }

     return ans ;
}
////////////////////////////////////////////////////////////////////////////////
// 空きのＦＡＴ番号を探す処理
unsigned long search_fat()
{
     unsigned long ans ;
     unsigned int i ;
     int j , x , k ;

     ans = 0 ;
     // １組の総ＦＡＴ数分繰り返す
     for (i=0 ; i<SectorsPerFatSU ; i++) {
          if (sblock_read(Fat_Area_StartP+i,MMCbuffer) == 0) {
               for (j=0 ; j<SECTER_BYTES ; j=j+FatType) {
                    // 空きのＦＡＴが有ったぞぉ
                    x = 0 ;
                    for (k=0 ; k<FatType ; k++) x = x | MMCbuffer[j+k] ;
                    if (x == 0) {
                         MMCbuffer[j]   = 0xff ;
                         MMCbuffer[j+1] = 0xff ;
                         if (FatType == 4) {    // FAT32
                              MMCbuffer[j+2] = 0xff ;
                              MMCbuffer[j+3] = 0x0f ;
                         }
                         // 予約更新
                         if (sblock_write(Fat_Area_StartP+i,MMCbuffer) == 0) {
                              // ２組目のFATも書込む
                              sblock_write((Fat_Area_StartP+i)+SectorsPerFatSU,MMCbuffer) ;
                              ans = (i * SECTER_BYTES + j) / FatType ;
                         }
                         i = SectorsPerFatSU ;
                         break ;  // 検索終了
                    }
               }
          } else break ;
     }
     return ans ;
}
////////////////////////////////////////////////////////////////////////////////
// ディレクトリエントリの更新処理
int direntry_make(unsigned long no,char *filename,struct FDS *fds)
{
     struct DIR_ENTRY *inf ;
     unsigned long p ;
     unsigned int x , y ;
     int ans ;

     ans = -1 ;
     // ディレクトリエントリを読込む
     x = fds->DirEntryIndex - 1 ;
     y = SECTER_BYTES / sizeof(struct DIR_ENTRY) ;
     p = Dir_Entry_StartP + (x / y) ;
     if (sblock_read(p,MMCbuffer) == 0) {
          inf = (struct DIR_ENTRY *)&MMCbuffer[(x % y) * sizeof(struct DIR_ENTRY)] ;
          if (no != 0) {
               memset(inf,0x00,sizeof(struct DIR_ENTRY)) ;
               // ファイル名を設定する
               memcpy(inf->FileName,filename,11) ;
               // ファイルの属性を設定する
               inf->Attributes = 0x20 ;
               // ファイルの新規作成
               inf->FileSize = 0 ;
               // ファイルの作成時間を設定する
               
               // ファイルの作成日を設定する
               
               // アクセス日を設定する
               
               // データ格納先のFAT番号を設定する
               inf->FirstClusterHigh = (unsigned int)(no >> 16) ;
               inf->FirstClusterLow  = (unsigned int)(no & 0x0000ffff) ;
               // ファイルのアクセス情報を設定する
               fds->FileSeekP = 0 ;
               fds->FileSize  = 0 ;
               // データ格納先のFAT番号を記録
               fds->FirstFatno = inf->FirstClusterHigh ;
               fds->FirstFatno = (fds->FirstFatno<<16) | inf->FirstClusterLow ;
          } else {
               // ファイルのサイズを更新する
               inf->FileSize = inf->FileSize + fds->AppendSize ;
               // ファイル書込み日時を設定する
               
               // アクセス日を設定する
               
          }
          // ディレクトリエントリの更新
          ans = sblock_write(p,MMCbuffer) ;
     }
     return ans ;
}
////////////////////////////////////////////////////////////////////////////////
// ファイル名の成形を行う処理
void filename_check(char *c,const char *filename)
{
     int i ;

     memset(c,0x20,11) ;
     for (i=0 ; i<8 ; i++) {
          if (*filename == '.') {
               c = c + (8-i) ;
               filename++ ;
               break ;
          }
          *c = *filename ;
          c++ ;
          filename++ ;
     }
     if (i > 7) filename++ ;
     for (i=0 ; i<3 ; i++) {
          if (*filename == 0x00) break ;
          *c = *filename ;
          c++ ;
          filename++ ;
     }
}
/*******************************************************************************
*  ans = SD_Open(filename,oflag)                                               *
*    ファイルのオープンを行う処理                                              *
*    filename : ファイル名(xxxxxxxx.xxx)を指定します                           *
*               拡張子は必ず指定、また英文字は大文字を指定 。                  *
*    oflag    : アクセスのフラグを指定します                                   *
*               O_READ   読み込み専用(ファイルが存在しない時はエラー)          *
*               O_APPEND 追加書込み専用(ファイルの最後に追加します)            *
*               O_RDWR   読み書き可能(ファイルが無い時は作成されます)          *
*                                                                              *
*    ans  : 正常＝０  異常＝−１                                               *
*******************************************************************************/
int SD_Open(const char *filename,int oflag)
{
     unsigned long no ;
     char c[11] ;
     int  ans , ret ;

     ret = -1 ;
     if (fds.Oflag != 0) return ret ;        // 既にオープンされている
     fds.Oflag = 0 ;
     // 指定のファイル名を成形する
     filename_check(c,filename) ;
     // 指定されたファイルを検索する
     ans = search_file(c,(struct FDS *)&fds) ;
     if (ans > 0) {
          if (oflag == O_READ && ans == 1) ret = 0 ;
          if (oflag == O_APPEND && ans == 1) {
               // ファイルのアクセス位置をファイルの最後＋１に設定する
               fds.FileSeekP = fds.FileSize ;
               ret = 0 ;
          }
          if (oflag == O_RDWR && (ans == 1 || ans == 2)) {
               if (ans == 2) {
                    // 新規ファイルの作成を行う
                    if (fds.DirEntryIndex != 0) {
                         // 空きのFATを探して確保する
                         no = search_fat() ;
                         if (no != 0) {
                              // ディレクトリエントリの作成を行う
                              if (direntry_make(no,c,(struct FDS *)&fds) == 0) ret = 0 ;
                         }
                    }
               } else ret = 0 ;
          }
          if (ret == 0) {
               // ファイルにアクセス可能とする
               fds.Oflag = oflag ;
               fds.AppendSize = 0 ;
          }
     }

     return ret ;
}
/*******************************************************************************
*  SD_Close()                                                                  *
*    ファイルのクローズを行う処理                                              *
*    データを追加した時のファイルサイズがこの関数で書き込まれます。            *
*******************************************************************************/
void SD_Close()
{
     // 書き込みオープン時の処理
     if (fds.Oflag & (O_APPEND | O_RDWR)) {
          if (fds.AppendSize == 0) return ;
          // ディレクトリエントリの更新を行う
          direntry_make(0,0,(struct FDS *)&fds) ;
     }
     // ファイルのアクセス情報を初期化する
     fds.Oflag = 0 ;
}
////////////////////////////////////////////////////////////////////////////////
// 指定されたFAT番号の次のFAT番号を得る処理
unsigned long next_fat_read(unsigned long fatno,struct FDS *fds)
{
     union {
          unsigned char c[4] ;
          unsigned long i ;
     } no ;
     unsigned long p , x , y , ans ;
     int j ;

     // ＦＡＴ領域のデータを読込む
     p = Fat_Area_StartP + (fatno / (SECTER_BYTES/FatType)) ;
     ans = sblock_read(p,MMCbuffer) ;
     if (ans == 0) {
          x = (fatno % (SECTER_BYTES/FatType)) * FatType ;
          no.i = 0 ;
          for (j=0 ; j<FatType ; j++) no.c[j] = MMCbuffer[x+j] ;
          // 次のチェーン先FAT番号を得る
          ans = no.i ;
          if (FatType == 4) y = 0x0fffffff ;  // FAT32
          else              y = 0xffff ;
          // 次のチェーン先がない時は新規にチェーン先ＦＡＴを作成する
          if (y == ans) {
               ans = search_fat() ;     // 新ＦＡＴ番号の空きを探す
               if (ans != 0) {
                    // チェーン元のＦＡＴ情報を更新する
                    if (sblock_read(p,MMCbuffer) == 0) {
                         no.i = ans ;
                         for (j=0 ; j<FatType ; j++) MMCbuffer[x+j] = no.c[j] ;
                         if (sblock_write(p,MMCbuffer) == 0) {
                              // ２組目のFATも書込む
                              sblock_write(p + SectorsPerFatSU,MMCbuffer) ;
                         } else ans = 0 ;
                    } else ans = 0 ;
               }
          }
     } else ans = 0 ;

     return ans ;
}
////////////////////////////////////////////////////////////////////////////////
// シーク位置からFAT番号(クラスタ番号)を算出する処理
void fatno_seek_conv(unsigned long *fatno,struct FDS *fds)
{
     unsigned int  p ;
     int  i ;

     // データのシーク位置から読出論理セクタ位置を算出し何番目の論理クラスタ位置か？
     p = (fds->FileSeekP / SECTER_BYTES) / Cluster1_SectorSU ;
     // FAT領域より論理クラスタから実際のFAT番号(クラスタ番号)を算出する
     *fatno = fds->FirstFatno ;
     for (i=0 ; i<p ; i++) {
          // 次のチェーン先FAT番号を読込んでおく
          *fatno = next_fat_read(*fatno,(struct FDS *)fds) ;
     }
}
////////////////////////////////////////////////////////////////////////////////
// この関数が実際にファイルから指定したバイト数だけ読み込む処理
// type : 1=SD_Readからのコール  2=SD_fGetsからのコール  3=SD_Writeからのコール
int sd_rdwr(char *buf,int nbyte,int type)
{
     unsigned long dtSP ;
     unsigned long fatno ;
     unsigned int  p , x ;
     int  i , c , ans ;

     // シーク位置からFAT番号(クラスタ番号)を算出
     fatno_seek_conv(&fatno,(struct FDS *)&fds) ;
     if (fatno == 0) return -1 ;                       // FAT領域読込みエラー
     // データの先頭セクタ位置の算出
     dtSP = Data_Area_StartP + ((fatno - 2) * Cluster1_SectorSU) ;
     p = (fds.FileSeekP / SECTER_BYTES) % Cluster1_SectorSU ; // クラスタ内のセクタ位置
     // データ領域からファイル内容を読出す
     ans = sblock_read(dtSP+p,MMCbuffer) ;
     if (ans == 0) {
          x = fds.FileSeekP % SECTER_BYTES ;
          c = 0 ;
          // 指定バイト数ぶん繰り返す
          for (i=0 ; i<nbyte ; i++ ) {
               if (type == 3) MMCbuffer[x] = *buf ;    // 書込み
               else           *buf = MMCbuffer[x] ;    // 読込み
               c++ ;
               x++ ;
               fds.FileSeekP++ ;
               if (fds.FileSeekP >= fds.FileSize) {
                    if (type < 3) break ;              // 最後まで読み込んだ
                    fds.AppendSize++ ;                 // データが追加された分だけカウント
               }
               if (c >= SECTER_BYTES) break ;          // SECTER_BYTESだけ処理した
               if (type == 2 && *buf == 0x0a) break ;  // ＬＦなら終了
               // 次のセクタにデータがまたがった場合の処理
               if (x >= SECTER_BYTES) {
                    // 書込み要求ならここまでのデータを書込む
                    if (type == 3) {
                         ans = sblock_write(dtSP+p,MMCbuffer) ;
                         if (ans != 0) {
                              ans = -1 ;               // データ領域書込みエラー
                              break ;
                         }
                    }
                    p++ ;
                    if (p >= Cluster1_SectorSU) {
                         // 次のクラスタにデータが有るようである
                         // シーク位置から次のFAT番号(クラスタ番号)を算出
                         fatno_seek_conv(&fatno,(struct FDS *)&fds) ;
                         if (fatno == 0) {
                              ans = -1 ;               // FAT領域読込みエラー
                              break ;
                         }
                         // データの先頭セクタ位置の算出
                         dtSP = Data_Area_StartP + ((fatno - 2) * Cluster1_SectorSU) ;
                         p = (fds.FileSeekP / SECTER_BYTES) % Cluster1_SectorSU ; // クラスタ内のセクタ位置
                    }
                    // 次のブロックを読込む
                    ans = sblock_read(dtSP+p,MMCbuffer) ;
                    if (ans == 0) x = 0 ;
                    else {
                         ans = -1 ;                    // データ領域読込みエラー
                         break ;
                    }
               }
               buf++ ;
          }
          // 書込み要求ならデータを書込む
          if (x != 0 && ans != -1 && type == 3) {
               ans = sblock_write(dtSP+p,MMCbuffer) ;
               if (ans != 0) ans = -1 ;                // データ領域書込みエラー
          }
          if (ans != -1) ans = c ;                     // 読書込んだバイト数を返す
     } else ans = -1 ;                                 // データ領域読込みエラー

     return ans ;
}
/*******************************************************************************
*  ans = SD_Write(buf,nbyte)                                                   *
*    ファイルへ指定したバイト数だけ書き込む処理                                *
*    ファイルの先頭から書込まれます、書込む位置を変える場合はSD_Seekを使用     *
*    *buf  : 書込むデータを格納した配列変数を指定します                        *
*    nbyte : 書込むデータのバイト数を指定します                                *
*                                                                              *
*    ans  : 正常＝書込んだバイト数  異常＝−１                                 *
*******************************************************************************/
int SD_Write(char *buf,int nbyte)
{
     if (!(fds.Oflag & (O_APPEND | O_RDWR))) return -1 ; // 書込みオープンでないエラー
     return sd_rdwr(buf,nbyte,3) ;
}
/*******************************************************************************
*  ans = SD_Read(buf,nbyte)                                                    *
*    ファイルから指定したバイト数だけ読み込む処理                              *
*    ファイルの先頭から読込まれます、読込む位置を変える場合はSD_Seekを使用     *
*    *buf  : 読込んだデータを格納する配列変数を指定します                      *
*    nbyte : 読込むデータのバイト数を指定します                                *
*            ファイルの最後(EOF)の場合、nbyteに満たなくてもそこで停止します    *
*                                                                              *
*    ans  : 正常＝読込んだバイト数  異常＝−１  ＥＯＦ＝０                     *
*******************************************************************************/
int SD_Read(char *buf,int nbyte)
{
     if (!(fds.Oflag & (O_READ | O_RDWR))) return -1 ; // 読込みオープンでないエラー
     if (fds.FileSeekP >= fds.FileSize)    return  0 ; // EOF
     return sd_rdwr(buf,nbyte,1) ;
}
/*******************************************************************************
*  ans = SD_fGets(buf,nbyte)                                                   *
*    ファイルから１行読み込む処理                                              *
*    0x0A(LF)に出会うまで読込みます、だから 0x0d(CR)0x0a(LF) もOKです。        *
*    CRとLFはデータとしてbufに入ります、bufの確保するデータサイズに注意です。  *
*    また、LFに出会わなければnbyteまで読込みます。                             *
*    *buf  : 読込むデータを格納した配列変数を指定します                        *
*    nbyte : 読込むデータのバイト数を指定します                                *
*                                                                              *
*    ans  : 正常＝読込んだバイト数  異常＝−１  ＥＯＦ＝０                     *
*******************************************************************************/
int SD_fGets(char *buf,int nbyte)
{
     if (!(fds.Oflag & (O_READ | O_RDWR))) return -1 ; // 読込みオープンでないエラー
     if (fds.FileSeekP >= fds.FileSize)    return  0 ; // EOF
     return sd_rdwr(buf,nbyte,2) ;
}
/*******************************************************************************
*  ans = SD_Size()                                                             *
*    ファイルのサイズを得る処理(現在SDに書込まれているサイズを返す)            *
*                                                                              *
*    ans  : 正常＝ファイルのサイズ  異常＝0xffffffff                           *
*******************************************************************************/
unsigned long SD_Size()
{
     if (fds.Oflag == 0) return 0xffffffff ;
     return fds.FileSize + fds.AppendSize ;
}
/*******************************************************************************
*  ans = SD_Position()                                                         *
*    ファイルの読書きポインタ値を得る処理                                      *
*                                                                              *
*    ans  : 正常＝現在位置付けされているファイルポインタ値  異常＝0xffffffff   *
*******************************************************************************/
unsigned long SD_Position()
{
     if (fds.Oflag == 0) return 0xffffffff ;
     return fds.FileSeekP ;
}
/*******************************************************************************
*  ans = SD_Seek(offset,sflag)                                                 *
*    ファイルの読書きポインタを移動させる処理                                  *
*    offset : 位置付けする場所(オフセット値)を指定します                       *
*    sflag  : 位置付けするオフセット値の方向を示すフラグを指定します           *
*             1 = ファイルの先頭からのオフセット値ですよ                       *
*             2 = 現在の場所から後ろ方向に位置付するオフセット値ですよ         *
*             3 = 現在の場所から前方向に位置付するオフセット値ですよ           *
*             4 = ファイル最後のバイトから後ろ方向に位置付けします             *
*                                                                              *
*    ans  : 正常＝移動先のファイルポインタ値  異常＝0xffffffff                 *
*******************************************************************************/
unsigned long SD_Seek(unsigned long offset,int sflag)
{
     unsigned long x , ans ;

     ans = 0xffffffff ;
     if (!(fds.Oflag & (O_READ | O_RDWR))) return ans ; // READ/RDWRオープン以外はエラー
     if (fds.AppendSize != 0) return ans ;              // データ追加中はシーク出来ない
     switch (sflag) {
        case 1:// 先頭から位置付する
               if (offset < fds.FileSize) ans = fds.FileSeekP = offset ;
               break ;
        case 2:// 現在の場所から後ろ方向に位置付する
               x = fds.FileSeekP + offset ;
               if (x < fds.FileSize) ans = fds.FileSeekP = x ;
               break ;
        case 3:// 現在の場所から前方向に位置付する
               x = fds.FileSize - fds.FileSeekP ;
               if (x >= offset) ans = fds.FileSeekP = fds.FileSeekP - offset ;
               break ;
        case 4:// ファイルの最後のバイトから後ろ方向に位置付けします
               if (fds.FileSize != 0) ans = fds.FileSeekP = (fds.FileSize-1) + offset ;
               else                   ans = fds.FileSeekP = 0 ;
               break ;
     }
     return ans ;
}
